README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-01 Mon 12:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blimp Environment</title>
<meta name="author" content="DTR" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://raw.githubusercontent.com/rougier/notebook-mode/master/notebook.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Blimp Environment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org02334d7">Blimp Environment</a></li>
<li><a href="#org6cf3e40">Diving into how each functions work</a></li>
</ul>
</div>
</div>


<div id="outline-container-org02334d7" class="outline-2">
<h2 id="org02334d7">Blimp Environment</h2>
<div class="outline-text-2" id="text-org02334d7">
<p>
The purpose of this blimp environment is to help train a RL network. It uses Mujoco for it's physic simulation.
It provides the following functions to aid with any sort of learning algorithms. It is tailored towards
Reinforcemnet learning, can closely resembles many of the basic capabilities of gymanisum, dm<sub>control</sub>, and
pytorch environments.
</p>

<p>
Example Use case:
</p>

<div class="org-src-container">
<pre class="src src-python">
"""
BlimpEnv takes the path to the model as the input, but by default it uses the Sano Blimp which is used
for this project.
render_mode paramater is used to specify how to render what is happening,
* Human = Dispaly everything
* Graph = Show graph of how the reward is changing over time
"""
env = BlimpEnv(render_mode="human")

"""
Env reset will reset the model to it's original state, and returns the starting state of the model/environment
It will have other misc information which won't be going to the network.
"""
state, info = env.reset()

"""
Evn step function will take in action and evaluate the action, and return it's next observation and
the reward the action generated. Similar to the reset it will provide other information that can use useful
for debugging and other purposes.
"""
observation, reward, terminated, info = env.step(action)

</pre>
</div>
</div>
</div>



<div id="outline-container-org6cf3e40" class="outline-2">
<h2 id="org6cf3e40">Diving into how each functions work</h2>
</div>
</div>
</body>
</html>
